{
  "passages": [
    {
      "text": "<audio src='soundbank://soundlibrary/nature/amzn_sfx_ocean_wave_surf_01'/>You awaken on a beach. You're not entirely sure how you got here. You're a mudcrab, but, that's really about all you know. It's hot. You know you don't like being hot. Perhaps some shade would be nice. As you scan your surroundings you see a castle in the far off distance with a shaded path leading up to it. Closer to you is a sewer grate built into the side of the wall, a cool breeze is coming from the grate. Behind you lies the ocean. You can just sit here and think awhile.",
      "links": [
        {
          "name": "path",
          "link": "path",
          "pid": "2"
        },
        {
          "name": "sewer",
          "link": "sewer",
          "pid": "3"
        },
        {
          "name": "think",
          "link": "think",
          "pid": "5"
        }
      ],
      "name": "beach",
      "pid": "1",
      "position": {
        "x": "699",
        "y": "401"
      },
      "special": []
    },
    {
      "text": "As you make your way to the castle you see an odd cat-like creature standing along the road. As you get closer you notice that this creature is stands on it's hind legs and has an almost human aspect to it. You realize this creature is selling <break time='250ms' />rugs. Do you inspect the rugs or continue toward the castle? You can also return to the beach.",
      "links": [
        {
          "name": "inspect",
          "link": "inspect",
          "pid": "6"
        },
        {
          "name": "castle",
          "link": "castle",
          "pid": "7"
        },
        {
          "name": "beach",
          "link": "beach",
          "pid": "1"
        }
      ],
      "name": "path",
      "pid": "2",
      "position": {
        "x": "503",
        "y": "302"
      },
      "special": []
    },
    {
      "text": "The sewer grate greets you with a cool refreshing breeze. It's peaceful here. You feel safe. Perhaps that was why you didn't hear the footsteps <audio src='soundbank://soundlibrary/human/amzn_sfx_human_walking_01'/> coming up the grate. Or hear the sword being drawn by the escape prisoner. <audio src='soundbank://soundlibrary/foley/amzn_sfx_swoosh_fast_1x_01'/> Ironically, you can relate to the words the stranger says out loud as he plunges his sword through your thick shell. <audio src='https://s3.us-east-1.amazonaws.com/mudcrablife/polly.7027ac26-0760-4c84-85d7-2afc52028603.mp3'/>",
      "name": "grate",
      "pid": "3",
      "position": {
        "x": "1201",
        "y": "802"
      },
      "special": ["end"]
    },
    {
      "text": "In retrospect, carrying a large shiny coin into the ocean wasn't such a great idea. But at least the fish that spotted you was big enough that you were eaten in one giant gulp.",
      "name": "ocean",
      "pid": "4",
      "position": {
        "x": "1190",
        "y": "402"
      },
      "special": ["end"]
    },
    {
      "text": "Sometimes it pays to take time to think things through. However, this is not one of those times. As you sit there thinking in the shallow waters of the beach, the heat begins to steam you. At first this feels kind of nice, but your primitive mudcrab brain can't grasp the reality of the situation. Before long, you are a pile of steamed mudcrab legs. <audio src='soundbank://soundlibrary/musical/amzn_sfx_bell_timer_01'/> On the downside you are dead, on the upside side, your cooking skill went up by one.",
      "name": "think",
      "pid": "5",
      "position": {
        "x": "1200",
        "y": "599"
      },
      "special": ["end"]
    },
    {
      "text": "As you approach the cat-human you hear her say <audio src='https://s3.us-east-1.amazonaws.com/mudcrablife/polly.b59eed86-cc41-40e9-99cc-4d35f17a4d21.mp3'/> Khajitt smiles and seems genuinely interested in communicating with you. Do you talk to the creature or continue to the castle?",
      "links": [
        {
          "name": "castle",
          "link": "castle",
          "pid": "7"
        },
        {
          "name": "talk",
          "link": "talk",
          "pid": "8"
        }
      ],
      "name": "rugs",
      "pid": "6",
      "position": {
        "x": "527",
        "y": "489"
      },
      "special": []
    },
    {
      "text": "if(has coin){bestEnding}else{ending}-- these are not choices --",
      "links": [
        {
          "name": "best ending",
          "link": "best ending",
          "pid": "12"
        },
        {
          "name": "ending",
          "link": "ending",
          "pid": "13"
        }
      ],
      "name": "castle",
      "pid": "7",
      "position": {
        "x": "202",
        "y": "599"
      },
      "special": ["event"]
    },
    {
      "text": "Somehow the creatures explains that she wants to play a dice game with you. She appears to be offering you a very large shiny coin if you win! Will you play the game with the merchant.",
      "links": [
        {
          "name": "play",
          "link": "play",
          "pid": "9"
        },
        {
          "name": "castle",
          "link": "castle",
          "pid": "7"
        }
      ],
      "name": "talk",
      "pid": "8",
      "position": {
        "x": "414",
        "y": "642"
      },
      "special": []
    },
    {
      "text": "From your understanding you are about to play a dice game. You're pretty sure that an equal or higher roll means you win the coin. You, however, are a little unclear on what happens if you lose. <break time='500ms' />",
      "links": [
        {
          "name": "you win",
          "link": "you win",
          "pid": "10"
        },
        {
          "name": "you lose",
          "link": "you lose",
          "pid": "11"
        }
      ],
      "name": "play",
      "pid": "9",
      "position": {
        "x": "569",
        "y": "763"
      },
      "special": ["dice"]
    },
    {
      "text": "Looks like gambling comes pretty naturally to a posh mudcrab such as yourself. The creature looks both surprised and amused that you won. She rewards you with a large golden coin as promised.<audio src='soundbank://soundlibrary/musical/amzn_sfx_bell_short_chime_01'/> Seeing as a mud crab has no pockets, you decide that you should get this money put safely away. Perhaps the castle has a place you can store your coin or maybe you can find a place to hide the coin in the ocean?",
      "links": [
        {
          "name": "castle",
          "link": "castle",
          "pid": "7"
        },
        {
          "name": "ocean",
          "link": "ocean",
          "pid": "4"
        }
      ],
      "name": "you win",
      "pid": "10",
      "position": {
        "x": "597",
        "y": "1008"
      },
      "special": ["inventory:large-coin"]
    },
    {
      "text": "So it turns out the price of losing was being eaten by the creature. <break time='500ms' /> <audio src='https://s3.amazonaws.com/mudcrablife/polly.0aa50b3f-64e6-4d71-b772-777cccced6d5.mp3' />",
      "name": "you lose",
      "pid": "11",
      "position": {
        "x": "1194",
        "y": "1006"
      },
      "special": ["end"]
    },
    {
      "text": "You arrive at the castle and instantly you are overwhelmed at how huge this place is. <audio src='soundbank://soundlibrary/musical/amzn_sfx_trumpet_bugle_03'/> Like an entire sequel could be written just about your adventures here! As you wonder around the castle you see a group of mud crabs at a caffe drinking some sort of steaming brown liquid.<audio src='soundbank://soundlibrary/human/amzn_sfx_drinking_slurp_01'/> They are all wearing monocles and top hats. You greet them with a wave of your claw, which also happens to be carrying the largest coin they have ever seen. They notice that you are a posh mudcrab, and that you are, by mudcrab standards, extremely wealthy. You are immediately welcomed to their table and fitted with your own top hat and monocle. You are one of the mudcrab elite! <audio src='soundbank://soundlibrary/human/amzn_sfx_large_crowd_cheer_03'/> Tomorrow, you'll be joining the other mud crabs at their summer house, whatever that is.<audio src='https://s3.us-east-1.amazonaws.com/mudcrablife/polly.6d5ac991-ae83-455b-9e54-30eae73efb94.mp3' />",
      "name": "best ending",
      "pid": "12",
      "position": {
        "x": "93",
        "y": "398"
      },
      "special": ["end", "need picture of posh mudcrab"]
    },
    {
      "text": "You arrive at the castle and instantly you are overwhelmed at how huge this place is. <audio src='soundbank://soundlibrary/musical/amzn_sfx_trumpet_bugle_03'/> Like an entire sequel could be written just about your adventures here! As you wonder around the castle you see a group of mud crabs at a caffe drinking some sort of steaming brown liquid.<audio src='soundbank://soundlibrary/human/amzn_sfx_drinking_slurp_01'/> They are all wearing monocles and top hats. You greet them with a wave of your claw. They notice that you are a posh mudcrab, but your lack of money keeps you from joining their table. <audio src='soundbank://soundlibrary/ui/gameshow/amzn_ui_sfx_gameshow_negative_response_02'/> They motion over at the help wanted sign at the cafe.<audio src='soundbank://soundlibrary/foley/amzn_sfx_kitchen_ambience_01'/> You decide it's probably about time you get a job.",
      "name": "ending",
      "pid": "13",
      "position": {
        "x": "94",
        "y": "806"
      },
      "special": ["end"]
    }
  ],
  "name": "Mudcrab Life",
  "startnode": "1",
  "creator": "Jared Truscott",
  "creator-version": "2.2.1",
  "ifid": "1AB0D127-C9A5-49B1-B333-A1B61F6AC1FB"
}
